Revit 2027 API
Form.IsAutoCreaseEdge Method
Tell if an edge is an auto-crease on a top/bottom cap face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsAutoCreaseEdge(
	Reference edgeReference
)
Public Function IsAutoCreaseEdge (
	edgeReference As Reference
) As Boolean
public:
bool IsAutoCreaseEdge(
	Reference^ edgeReference
)
member IsAutoCreaseEdge :
        edgeReference : Reference -> bool
Parameters
edgeReference Reference
The reference of the edge to be checked.
Return Value
Boolean
See Also
Reference
Form Class
Autodesk.Revit.DB Namespace